app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "class title test"], ["room_number", 9]]
---
	def create
        @schoolclass = SchoolClass.new(school_class_params)
	    @schoolclass.save